renesas/fsp/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA2A2AD.h
/* ========================================================  BBFSAR  ========================================================= */
 #define R_SYSTEM_BBFSAR_NONSEC0_Pos               (0UL)          /*!< NONSEC0 (Bit 0)                                       */
 #define R_SYSTEM_BBFSAR_NONSEC0_Msk               (0x1UL)        /*!< NONSEC0 (Bitfield-Mask: 0x01)                         */
 #define R_SYSTEM_BBFSAR_NONSEC1_Pos               (1UL)          /*!< NONSEC1 (Bit 1)                                       */
 #define R_SYSTEM_BBFSAR_NONSEC1_Msk               (0x2UL)        /*!< NONSEC1 (Bitfield-Mask: 0x01)                         */
 #define R_SYSTEM_BBFSAR_NONSEC2_Pos               (2UL)          /*!< NONSEC2 (Bit 2)                                       */
 #define R_SYSTEM_BBFSAR_NONSEC2_Msk               (0x4UL)        /*!< NONSEC2 (Bitfield-Mask: 0x01)                         */
 #define R_SYSTEM_BBFSAR_NONSEC16_Pos              (16UL)         /*!< NONSEC16 (Bit 16)                                     */
 #define R_SYSTEM_BBFSAR_NONSEC16_Msk              (0x10000UL)    /*!< NONSEC16 (Bitfield-Mask: 0x01)                        */
 #define R_SYSTEM_BBFSAR_NONSEC17_Pos              (17UL)         /*!< NONSEC17 (Bit 17)                                     */
 #define R_SYSTEM_BBFSAR_NONSEC17_Msk              (0x20000UL)    /*!< NONSEC17 (Bitfield-Mask: 0x01)                        */
 #define R_SYSTEM_BBFSAR_NONSEC18_Pos              (18UL)         /*!< NONSEC18 (Bit 18)                                     */
 #define R_SYSTEM_BBFSAR_NONSEC18_Msk              (0x40000UL)    /*!< NONSEC18 (Bitfield-Mask: 0x01)                        */
 #define R_SYSTEM_BBFSAR_NONSEC19_Pos              (19UL)         /*!< NONSEC19 (Bit 19)                                     */
 #define R_SYSTEM_BBFSAR_NONSEC19_Msk              (0x80000UL)    /*!< NONSEC19 (Bitfield-Mask: 0x01)                        */
 #define R_SYSTEM_BBFSAR_NONSEC20_Pos              (20UL)         /*!< NONSEC20 (Bit 20)                                     */
 #define R_SYSTEM_BBFSAR_NONSEC20_Msk              (0x100000UL)   /*!< NONSEC20 (Bitfield-Mask: 0x01)                        */
 #define R_SYSTEM_BBFSAR_NONSEC21_Pos              (21UL)         /*!< NONSEC21 (Bit 21)                                     */
 #define R_SYSTEM_BBFSAR_NONSEC21_Msk              (0x200000UL)   /*!< NONSEC21 (Bitfield-Mask: 0x01)                        */
 #define R_SYSTEM_BBFSAR_NONSEC22_Pos              (22UL)         /*!< NONSEC22 (Bit 22)                                     */
 #define R_SYSTEM_BBFSAR_NONSEC22_Msk              (0x400000UL)   /*!< NONSEC22 (Bitfield-Mask: 0x01)                        */
 #define R_SYSTEM_BBFSAR_NONSEC23_Pos              (23UL)         /*!< NONSEC23 (Bit 23)                                     */
 #define R_SYSTEM_BBFSAR_NONSEC23_Msk              (0x800000UL)   /*!< NONSEC23 (Bitfield-Mask: 0x01)                        */
/* ========================================================  DPFSAR  ========================================================= */
 #define R_SYSTEM_DPFSAR_DPFSA0_Pos                (0UL)          /*!< DPFSA0 (Bit 0)                                        */
 #define R_SYSTEM_DPFSAR_DPFSA0_Msk                (0x1UL)        /*!< DPFSA0 (Bitfield-Mask: 0x01)                          */
 #define R_SYSTEM_DPFSAR_DPFSA1_Pos                (1UL)          /*!< DPFSA1 (Bit 1)                                        */
 #define R_SYSTEM_DPFSAR_DPFSA1_Msk                (0x2UL)        /*!< DPFSA1 (Bitfield-Mask: 0x01)                          */
 #define R_SYSTEM_DPFSAR_DPFSA2_Pos                (2UL)          /*!< DPFSA2 (Bit 2)                                        */
 #define R_SYSTEM_DPFSAR_DPFSA2_Msk                (0x4UL)        /*!< DPFSA2 (Bitfield-Mask: 0x01)                          */
 #define R_SYSTEM_DPFSAR_DPFSA3_Pos                (3UL)          /*!< DPFSA3 (Bit 3)                                        */
 #define R_SYSTEM_DPFSAR_DPFSA3_Msk                (0x8UL)        /*!< DPFSA3 (Bitfield-Mask: 0x01)                          */
 #define R_SYSTEM_DPFSAR_DPFSA4_Pos                (4UL)          /*!< DPFSA4 (Bit 4)                                        */
 #define R_SYSTEM_DPFSAR_DPFSA4_Msk                (0x10UL)       /*!< DPFSA4 (Bitfield-Mask: 0x01)                          */
 #define R_SYSTEM_DPFSAR_DPFSA5_Pos                (5UL)          /*!< DPFSA5 (Bit 5)                                        */
 #define R_SYSTEM_DPFSAR_DPFSA5_Msk                (0x20UL)       /*!< DPFSA5 (Bitfield-Mask: 0x01)                          */
 #define R_SYSTEM_DPFSAR_DPFSA6_Pos                (6UL)          /*!< DPFSA6 (Bit 6)                                        */
 #define R_SYSTEM_DPFSAR_DPFSA6_Msk                (0x40UL)       /*!< DPFSA6 (Bitfield-Mask: 0x01)                          */
 #define R_SYSTEM_DPFSAR_DPFSA7_Pos                (7UL)          /*!< DPFSA7 (Bit 7)                                        */
 #define R_SYSTEM_DPFSAR_DPFSA7_Msk                (0x80UL)       /*!< DPFSA7 (Bitfield-Mask: 0x01)                          */
 #define R_SYSTEM_DPFSAR_DPFSA8_Pos                (8UL)          /*!< DPFSA8 (Bit 8)                                        */
 #define R_SYSTEM_DPFSAR_DPFSA8_Msk                (0x100UL)      /*!< DPFSA8 (Bitfield-Mask: 0x01)                          */
 #define R_SYSTEM_DPFSAR_DPFSA9_Pos                (9UL)          /*!< DPFSA9 (Bit 9)                                        */
 #define R_SYSTEM_DPFSAR_DPFSA9_Msk                (0x200UL)      /*!< DPFSA9 (Bitfield-Mask: 0x01)                          */
 #define R_SYSTEM_DPFSAR_DPFSA10_Pos               (10UL)         /*!< DPFSA10 (Bit 10)                                      */
 #define R_SYSTEM_DPFSAR_DPFSA10_Msk               (0x400UL)      /*!< DPFSA10 (Bitfield-Mask: 0x01)                         */
 #define R_SYSTEM_DPFSAR_DPFSA11_Pos               (11UL)         /*!< DPFSA11 (Bit 11)                                      */
 #define R_SYSTEM_DPFSAR_DPFSA11_Msk               (0x800UL)      /*!< DPFSA11 (Bitfield-Mask: 0x01)                         */
 #define R_SYSTEM_DPFSAR_DPFSA12_Pos               (12UL)         /*!< DPFSA12 (Bit 12)                                      */
 #define R_SYSTEM_DPFSAR_DPFSA12_Msk               (0x1000UL)     /*!< DPFSA12 (Bitfield-Mask: 0x01)                         */
 #define R_SYSTEM_DPFSAR_DPFSA13_Pos               (13UL)         /*!< DPFSA13 (Bit 13)                                      */
 #define R_SYSTEM_DPFSAR_DPFSA13_Msk               (0x2000UL)     /*!< DPFSA13 (Bitfield-Mask: 0x01)                         */
 #define R_SYSTEM_DPFSAR_DPFSA14_Pos               (14UL)         /*!< DPFSA14 (Bit 14)                                      */
 #define R_SYSTEM_DPFSAR_DPFSA14_Msk               (0x4000UL)     /*!< DPFSA14 (Bitfield-Mask: 0x01)                         */
 #define R_SYSTEM_DPFSAR_DPFSA15_Pos               (15UL)         /*!< DPFSA15 (Bit 15)                                      */
 #define R_SYSTEM_DPFSAR_DPFSA15_Msk               (0x8000UL)     /*!< DPFSA15 (Bitfield-Mask: 0x01)                         */
 #define R_SYSTEM_DPFSAR_DPFSA16_Pos               (16UL)         /*!< DPFSA16 (Bit 16)                                      */
 #define R_SYSTEM_DPFSAR_DPFSA16_Msk               (0x10000UL)    /*!< DPFSA16 (Bitfield-Mask: 0x01)                         */
 #define R_SYSTEM_DPFSAR_DPFSA17_Pos               (17UL)         /*!< DPFSA17 (Bit 17)                                      */
 #define R_SYSTEM_DPFSAR_DPFSA17_Msk               (0x20000UL)    /*!< DPFSA17 (Bitfield-Mask: 0x01)                         */
 #define R_SYSTEM_DPFSAR_DPFSA18_Pos               (18UL)         /*!< DPFSA18 (Bit 18)                                      */
 #define R_SYSTEM_DPFSAR_DPFSA18_Msk               (0x40000UL)    /*!< DPFSA18 (Bitfield-Mask: 0x01)                         */
 #define R_SYSTEM_DPFSAR_DPFSA19_Pos               (19UL)         /*!< DPFSA19 (Bit 19)                                      */
 #define R_SYSTEM_DPFSAR_DPFSA19_Msk               (0x80000UL)    /*!< DPFSA19 (Bitfield-Mask: 0x01)                         */
 #define R_SYSTEM_DPFSAR_DPFSA20_Pos               (20UL)         /*!< DPFSA20 (Bit 20)                                      */
 #define R_SYSTEM_DPFSAR_DPFSA20_Msk               (0x100000UL)   /*!< DPFSA20 (Bitfield-Mask: 0x01)                         */
 #define R_SYSTEM_DPFSAR_DPFSA24_Pos               (24UL)         /*!< DPFSA24 (Bit 24)                                      */
 #define R_SYSTEM_DPFSAR_DPFSA24_Msk               (0x1000000UL)  /*!< DPFSA24 (Bitfield-Mask: 0x01)                         */
 #define R_SYSTEM_DPFSAR_DPFSA26_Pos               (26UL)         /*!< DPFSA26 (Bit 26)                                      */
 #define R_SYSTEM_DPFSAR_DPFSA26_Msk               (0x4000000UL)  /*!< DPFSA26 (Bitfield-Mask: 0x01)                         */
 #define R_SYSTEM_DPFSAR_DPFSA27_Pos               (27UL)         /*!< DPFSA27 (Bit 27)                                      */
 #define R_SYSTEM_DPFSAR_DPFSA27_Msk               (0x8000000UL)  /*!< DPFSA27 (Bitfield-Mask: 0x01)                         */
/* ========================================================  DPSWCR  ========================================================= */
 #define R_SYSTEM_DPSWCR_WTSTS_Pos                 (0UL)          /*!< WTSTS (Bit 0)                                         */
 #define R_SYSTEM_DPSWCR_WTSTS_Msk                 (0x3fUL)       /*!< WTSTS (Bitfield-Mask: 0x3f)                           */
/* ======================================================  VBATTMNSELR  ====================================================== */
 #define R_SYSTEM_VBATTMNSELR_VBATTMNSEL_Pos       (0UL)          /*!< VBATTMNSEL (Bit 0)                                    */
 #define R_SYSTEM_VBATTMNSELR_VBATTMNSEL_Msk       (0x1UL)        /*!< VBATTMNSEL (Bitfield-Mask: 0x01)                      */
/* =======================================================  VBATTMONR  ======================================================= */
 #define R_SYSTEM_VBATTMONR_VBATTMON_Pos           (0UL)          /*!< VBATTMON (Bit 0)                                      */
 #define R_SYSTEM_VBATTMONR_VBATTMON_Msk           (0x1UL)        /*!< VBATTMON (Bitfield-Mask: 0x01)                        */
/* =======================================================  VBTLVDCR  ======================================================== */
 #define R_SYSTEM_VBTLVDCR_LVDE_Pos                (4UL)          /*!< LVDE (Bit 4)                                          */
 #define R_SYSTEM_VBTLVDCR_LVDE_Msk                (0x10UL)       /*!< LVDE (Bitfield-Mask: 0x01)                            */
 #define R_SYSTEM_VBTLVDCR_LVL_Pos                 (5UL)          /*!< LVL (Bit 5)                                           */
 #define R_SYSTEM_VBTLVDCR_LVL_Msk                 (0xe0UL)       /*!< LVL (Bitfield-Mask: 0x07)                             */
/* =======================================================  VBTLVDSR  ======================================================== */
 #define R_SYSTEM_VBTLVDSR_DET_Pos                 (1UL)          /*!< DET (Bit 1)                                           */
 #define R_SYSTEM_VBTLVDSR_DET_Msk                 (0x2UL)        /*!< DET (Bitfield-Mask: 0x01)                             */
 #define R_SYSTEM_VBTLVDSR_MON_Pos                 (5UL)          /*!< MON (Bit 5)                                           */
 #define R_SYSTEM_VBTLVDSR_MON_Msk                 (0x20UL)       /*!< MON (Bitfield-Mask: 0x01)                             */
/* =======================================================  VBTCMPCR  ======================================================== */
 #define R_SYSTEM_VBTCMPCR_CMPE_Pos                (0UL)          /*!< CMPE (Bit 0)                                          */
 #define R_SYSTEM_VBTCMPCR_CMPE_Msk                (0x1UL)        /*!< CMPE (Bitfield-Mask: 0x01)                            */
/* =======================================================  VBTLVDICR  ======================================================= */
 #define R_SYSTEM_VBTLVDICR_IE_Pos                 (0UL)          /*!< IE (Bit 0)                                            */
 #define R_SYSTEM_VBTLVDICR_IE_Msk                 (0x1UL)        /*!< IE (Bitfield-Mask: 0x01)                              */
 #define R_SYSTEM_VBTLVDICR_IDTSEL_Pos             (4UL)          /*!< IDTSEL (Bit 4)                                        */
 #define R_SYSTEM_VBTLVDICR_IDTSEL_Msk             (0x30UL)       /*!< IDTSEL (Bitfield-Mask: 0x03)                          */
/* =======================================================  VRTLVDCR  ======================================================== */
 #define R_SYSTEM_VRTLVDCR_LVDE_Pos                (4UL)          /*!< LVDE (Bit 4)                                          */
 #define R_SYSTEM_VRTLVDCR_LVDE_Msk                (0x10UL)       /*!< LVDE (Bitfield-Mask: 0x01)                            */
 #define R_SYSTEM_VRTLVDCR_LVL_Pos                 (6UL)          /*!< LVL (Bit 6)                                           */
 #define R_SYSTEM_VRTLVDCR_LVL_Msk                 (0xc0UL)       /*!< LVL (Bitfield-Mask: 0x03)                             */
/* =========================================================  VRTSR  ========================================================= */
 #define R_SYSTEM_VRTSR_PORDET_Pos                 (0UL)          /*!< PORDET (Bit 0)                                        */
 #define R_SYSTEM_VRTSR_PORDET_Msk                 (0x1UL)        /*!< PORDET (Bitfield-Mask: 0x01)                          */
 #define R_SYSTEM_VRTSR_DET_Pos                    (1UL)          /*!< DET (Bit 1)                                           */
 #define R_SYSTEM_VRTSR_DET_Msk                    (0x2UL)        /*!< DET (Bitfield-Mask: 0x01)                             */
 #define R_SYSTEM_VRTSR_VRTVLD_Pos                 (4UL)          /*!< VRTVLD (Bit 4)                                        */
 #define R_SYSTEM_VRTSR_VRTVLD_Msk                 (0x10UL)       /*!< VRTVLD (Bitfield-Mask: 0x01)                          */
 #define R_SYSTEM_VRTSR_MON_Pos                    (5UL)          /*!< MON (Bit 5)                                           */
 #define R_SYSTEM_VRTSR_MON_Msk                    (0x20UL)       /*!< MON (Bitfield-Mask: 0x01)                             */
/* =======================================================  VRTCMPCR  ======================================================== */
 #define R_SYSTEM_VRTCMPCR_CMPE_Pos                (0UL)          /*!< CMPE (Bit 0)                                          */
 #define R_SYSTEM_VRTCMPCR_CMPE_Msk                (0x1UL)        /*!< CMPE (Bitfield-Mask: 0x01)                            */
/* =======================================================  VRTLVDICR  ======================================================= */
 #define R_SYSTEM_VRTLVDICR_IE_Pos                 (0UL)          /*!< IE (Bit 0)                                            */
 #define R_SYSTEM_VRTLVDICR_IE_Msk                 (0x1UL)        /*!< IE (Bitfield-Mask: 0x01)                              */
 #define R_SYSTEM_VRTLVDICR_IDTSEL_Pos             (4UL)          /*!< IDTSEL (Bit 4)                                        */
 #define R_SYSTEM_VRTLVDICR_IDTSEL_Msk             (0x30UL)       /*!< IDTSEL (Bitfield-Mask: 0x03)                          */
/* ========================================================  EXLVDCR  ======================================================== */
 #define R_SYSTEM_EXLVDCR_LVDE_Pos                 (4UL)          /*!< LVDE (Bit 4)                                          */
 #define R_SYSTEM_EXLVDCR_LVDE_Msk                 (0x10UL)       /*!< LVDE (Bitfield-Mask: 0x01)                            */
/* ========================================================  EXLVDSR  ======================================================== */
 #define R_SYSTEM_EXLVDSR_DET_Pos                  (1UL)          /*!< DET (Bit 1)                                           */
 #define R_SYSTEM_EXLVDSR_DET_Msk                  (0x2UL)        /*!< DET (Bitfield-Mask: 0x01)                             */
 #define R_SYSTEM_EXLVDSR_MON_Pos                  (5UL)          /*!< MON (Bit 5)                                           */
 #define R_SYSTEM_EXLVDSR_MON_Msk                  (0x20UL)       /*!< MON (Bitfield-Mask: 0x01)                             */
/* ======================================================  EXLVDCMPCR  ======================================================= */
 #define R_SYSTEM_EXLVDCMPCR_CMPE_Pos              (0UL)          /*!< CMPE (Bit 0)                                          */
 #define R_SYSTEM_EXLVDCMPCR_CMPE_Msk              (0x1UL)        /*!< CMPE (Bitfield-Mask: 0x01)                            */
/* =======================================================  EXLVDICR  ======================================================== */
 #define R_SYSTEM_EXLVDICR_IE_Pos                  (0UL)          /*!< IE (Bit 0)                                            */
 #define R_SYSTEM_EXLVDICR_IE_Msk                  (0x1UL)        /*!< IE (Bitfield-Mask: 0x01)                              */
 #define R_SYSTEM_EXLVDICR_IDTSEL_Pos              (4UL)          /*!< IDTSEL (Bit 4)                                        */
 #define R_SYSTEM_EXLVDICR_IDTSEL_Msk              (0x30UL)       /*!< IDTSEL (Bitfield-Mask: 0x03)                          */

/* =========================================================================================================================== */
/* ================                                          R_TRNG                                           ================ */
/* =========================================================================================================================== */

