renesas/fsp/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA2A2AD.h
/* ========================================================  TRNGSDR  ======================================================== */
 #define R_TRNG_TRNGSDR_SDATA_Pos       (0UL)    /*!< SDATA (Bit 0)                                         */
 #define R_TRNG_TRNGSDR_SDATA_Msk       (0xffUL) /*!< SDATA (Bitfield-Mask: 0xff)                           */
/* =======================================================  TRNGSCR0  ======================================================== */
 #define R_TRNG_TRNGSCR0_RDRDY_Pos      (7UL)    /*!< RDRDY (Bit 7)                                         */
 #define R_TRNG_TRNGSCR0_RDRDY_Msk      (0x80UL) /*!< RDRDY (Bitfield-Mask: 0x01)                           */
 #define R_TRNG_TRNGSCR0_SGCEN_Pos      (3UL)    /*!< SGCEN (Bit 3)                                         */
 #define R_TRNG_TRNGSCR0_SGCEN_Msk      (0x8UL)  /*!< SGCEN (Bitfield-Mask: 0x01)                           */
 #define R_TRNG_TRNGSCR0_SGSTART_Pos    (2UL)    /*!< SGSTART (Bit 2)                                       */
 #define R_TRNG_TRNGSCR0_SGSTART_Msk    (0x4UL)  /*!< SGSTART (Bitfield-Mask: 0x01)                         */
/* =======================================================  TRNGSCR1  ======================================================== */
 #define R_TRNG_TRNGSCR1_INTEN_Pos      (0UL)    /*!< INTEN (Bit 0)                                         */
 #define R_TRNG_TRNGSCR1_INTEN_Msk      (0x1UL)  /*!< INTEN (Bitfield-Mask: 0x01)                           */

/* =========================================================================================================================== */
/* ================                                           R_TSN                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  TSCDR  ========================================================= */
/* ========================================================  TSCDRH  ========================================================= */
 #define R_TSN_TSCDRH_TSCDRH_Pos    (0UL)    /*!< TSCDRH (Bit 0)                                        */
 #define R_TSN_TSCDRH_TSCDRH_Msk    (0xffUL) /*!< TSCDRH (Bitfield-Mask: 0xff)                          */
/* ========================================================  TSCDRL  ========================================================= */
 #define R_TSN_TSCDRL_TSCDRL_Pos    (0UL)    /*!< TSCDRL (Bit 0)                                        */
 #define R_TSN_TSCDRL_TSCDRL_Msk    (0xffUL) /*!< TSCDRL (Bitfield-Mask: 0xff)                          */

/* =========================================================================================================================== */
/* ================                                           R_WDT                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  WDTRR  ========================================================= */
 #define R_WDT_WDTRR_WDTRR_Pos        (0UL)      /*!< WDTRR (Bit 0)                                         */
 #define R_WDT_WDTRR_WDTRR_Msk        (0xffUL)   /*!< WDTRR (Bitfield-Mask: 0xff)                           */
/* =========================================================  WDTCR  ========================================================= */
 #define R_WDT_WDTCR_RPSS_Pos         (12UL)     /*!< RPSS (Bit 12)                                         */
 #define R_WDT_WDTCR_RPSS_Msk         (0x3000UL) /*!< RPSS (Bitfield-Mask: 0x03)                            */
 #define R_WDT_WDTCR_RPES_Pos         (8UL)      /*!< RPES (Bit 8)                                          */
 #define R_WDT_WDTCR_RPES_Msk         (0x300UL)  /*!< RPES (Bitfield-Mask: 0x03)                            */
 #define R_WDT_WDTCR_CKS_Pos          (4UL)      /*!< CKS (Bit 4)                                           */
 #define R_WDT_WDTCR_CKS_Msk          (0xf0UL)   /*!< CKS (Bitfield-Mask: 0x0f)                             */
 #define R_WDT_WDTCR_TOPS_Pos         (0UL)      /*!< TOPS (Bit 0)                                          */
 #define R_WDT_WDTCR_TOPS_Msk         (0x3UL)    /*!< TOPS (Bitfield-Mask: 0x03)                            */
/* =========================================================  WDTSR  ========================================================= */
 #define R_WDT_WDTSR_REFEF_Pos        (15UL)     /*!< REFEF (Bit 15)                                        */
 #define R_WDT_WDTSR_REFEF_Msk        (0x8000UL) /*!< REFEF (Bitfield-Mask: 0x01)                           */
 #define R_WDT_WDTSR_UNDFF_Pos        (14UL)     /*!< UNDFF (Bit 14)                                        */
 #define R_WDT_WDTSR_UNDFF_Msk        (0x4000UL) /*!< UNDFF (Bitfield-Mask: 0x01)                           */
 #define R_WDT_WDTSR_CNTVAL_Pos       (0UL)      /*!< CNTVAL (Bit 0)                                        */
 #define R_WDT_WDTSR_CNTVAL_Msk       (0x3fffUL) /*!< CNTVAL (Bitfield-Mask: 0x3fff)                        */
/* ========================================================  WDTRCR  ========================================================= */
 #define R_WDT_WDTRCR_RSTIRQS_Pos     (7UL)      /*!< RSTIRQS (Bit 7)                                       */
 #define R_WDT_WDTRCR_RSTIRQS_Msk     (0x80UL)   /*!< RSTIRQS (Bitfield-Mask: 0x01)                         */
/* =======================================================  WDTCSTPR  ======================================================== */
 #define R_WDT_WDTCSTPR_SLCSTP_Pos    (7UL)      /*!< SLCSTP (Bit 7)                                        */
 #define R_WDT_WDTCSTPR_SLCSTP_Msk    (0x80UL)   /*!< SLCSTP (Bitfield-Mask: 0x01)                          */

/* =========================================================================================================================== */
/* ================                                          R_AES_B                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  AESCNTL  ======================================================== */
 #define R_AES_B_AESCNTL_BYTE_ORDER3_Pos        (11UL)     /*!< BYTE_ORDER3 (Bit 11)                                  */
 #define R_AES_B_AESCNTL_BYTE_ORDER3_Msk        (0x800UL)  /*!< BYTE_ORDER3 (Bitfield-Mask: 0x01)                     */
 #define R_AES_B_AESCNTL_BYTE_ORDER2_Pos        (10UL)     /*!< BYTE_ORDER2 (Bit 10)                                  */
 #define R_AES_B_AESCNTL_BYTE_ORDER2_Msk        (0x400UL)  /*!< BYTE_ORDER2 (Bitfield-Mask: 0x01)                     */
 #define R_AES_B_AESCNTL_BYTE_ORDER1_Pos        (9UL)      /*!< BYTE_ORDER1 (Bit 9)                                   */
 #define R_AES_B_AESCNTL_BYTE_ORDER1_Msk        (0x200UL)  /*!< BYTE_ORDER1 (Bitfield-Mask: 0x01)                     */
 #define R_AES_B_AESCNTL_BYTE_ORDER0_Pos        (8UL)      /*!< BYTE_ORDER0 (Bit 8)                                   */
 #define R_AES_B_AESCNTL_BYTE_ORDER0_Msk        (0x100UL)  /*!< BYTE_ORDER0 (Bitfield-Mask: 0x01)                     */
 #define R_AES_B_AESCNTL_CIPHER_USE_MODE_Pos    (4UL)      /*!< CIPHER_USE_MODE (Bit 4)                               */
 #define R_AES_B_AESCNTL_CIPHER_USE_MODE_Msk    (0xf0UL)   /*!< CIPHER_USE_MODE (Bitfield-Mask: 0x0f)                 */
 #define R_AES_B_AESCNTL_ENCMODE_Pos            (3UL)      /*!< ENCMODE (Bit 3)                                       */
 #define R_AES_B_AESCNTL_ENCMODE_Msk            (0x8UL)    /*!< ENCMODE (Bitfield-Mask: 0x01)                         */
 #define R_AES_B_AESCNTL_KEYSIZE_Pos            (1UL)      /*!< KEYSIZE (Bit 1)                                       */
 #define R_AES_B_AESCNTL_KEYSIZE_Msk            (0x6UL)    /*!< KEYSIZE (Bitfield-Mask: 0x03)                         */
/* ========================================================  AESCNTH  ======================================================== */
 #define R_AES_B_AESCNTH_SW_RST_Pos             (15UL)     /*!< SW_RST (Bit 15)                                       */
 #define R_AES_B_AESCNTH_SW_RST_Msk             (0x8000UL) /*!< SW_RST (Bitfield-Mask: 0x01)                          */
/* ========================================================  AESSTSL  ======================================================== */
 #define R_AES_B_AESSTSL_BUSY_Pos               (5UL)      /*!< BUSY (Bit 5)                                          */
 #define R_AES_B_AESSTSL_BUSY_Msk               (0x20UL)   /*!< BUSY (Bitfield-Mask: 0x01)                            */
 #define R_AES_B_AESSTSL_ODATA_VALID_Pos        (1UL)      /*!< ODATA_VALID (Bit 1)                                   */
 #define R_AES_B_AESSTSL_ODATA_VALID_Msk        (0x2UL)    /*!< ODATA_VALID (Bitfield-Mask: 0x01)                     */
 #define R_AES_B_AESSTSL_FIRST_ODATA_Pos        (0UL)      /*!< FIRST_ODATA (Bit 0)                                   */
 #define R_AES_B_AESSTSL_FIRST_ODATA_Msk        (0x1UL)    /*!< FIRST_ODATA (Bitfield-Mask: 0x01)                     */
/* ========================================================  AESSTSH  ======================================================== */
/* =======================================================  AESSTSCL  ======================================================== */
 #define R_AES_B_AESSTSCL_ODATA_VALID_C_Pos     (1UL)      /*!< ODATA_VALID_C (Bit 1)                                 */
 #define R_AES_B_AESSTSCL_ODATA_VALID_C_Msk     (0x2UL)    /*!< ODATA_VALID_C (Bitfield-Mask: 0x01)                   */
 #define R_AES_B_AESSTSCL_FIRST_ODATA_C_Pos     (0UL)      /*!< FIRST_ODATA_C (Bit 0)                                 */
 #define R_AES_B_AESSTSCL_FIRST_ODATA_C_Msk     (0x1UL)    /*!< FIRST_ODATA_C (Bitfield-Mask: 0x01)                   */
/* =======================================================  AESSTSCH  ======================================================== */
 #define R_AES_B_AESSTSCH_CCM_CNTR_Pos          (1UL)      /*!< CCM_CNTR (Bit 1)                                      */
 #define R_AES_B_AESSTSCH_CCM_CNTR_Msk          (0x2UL)    /*!< CCM_CNTR (Bitfield-Mask: 0x01)                        */
/* =======================================================  AESDCNTL  ======================================================== */
 #define R_AES_B_AESDCNTL_REM_Pos               (8UL)      /*!< REM (Bit 8)                                           */
 #define R_AES_B_AESDCNTL_REM_Msk               (0x7f00UL) /*!< REM (Bitfield-Mask: 0x7f)                             */
 #define R_AES_B_AESDCNTL_ATTR_Pos              (5UL)      /*!< ATTR (Bit 5)                                          */
 #define R_AES_B_AESDCNTL_ATTR_Msk              (0xe0UL)   /*!< ATTR (Bitfield-Mask: 0x07)                            */
 #define R_AES_B_AESDCNTL_LAST_Pos              (4UL)      /*!< LAST (Bit 4)                                          */
 #define R_AES_B_AESDCNTL_LAST_Msk              (0x10UL)   /*!< LAST (Bitfield-Mask: 0x01)                            */
 #define R_AES_B_AESDCNTL_NEWKEY_Pos            (3UL)      /*!< NEWKEY (Bit 3)                                        */
 #define R_AES_B_AESDCNTL_NEWKEY_Msk            (0x8UL)    /*!< NEWKEY (Bitfield-Mask: 0x01)                          */
 #define R_AES_B_AESDCNTL_FIRST_Pos             (2UL)      /*!< FIRST (Bit 2)                                         */
 #define R_AES_B_AESDCNTL_FIRST_Msk             (0x4UL)    /*!< FIRST (Bitfield-Mask: 0x01)                           */
 #define R_AES_B_AESDCNTL_ODATA_RDY_Pos         (1UL)      /*!< ODATA_RDY (Bit 1)                                     */
 #define R_AES_B_AESDCNTL_ODATA_RDY_Msk         (0x2UL)    /*!< ODATA_RDY (Bitfield-Mask: 0x01)                       */
 #define R_AES_B_AESDCNTL_AES_START_Pos         (0UL)      /*!< AES_START (Bit 0)                                     */
 #define R_AES_B_AESDCNTL_AES_START_Msk         (0x1UL)    /*!< AES_START (Bitfield-Mask: 0x01)                       */
/* =======================================================  AESDCNTH  ======================================================== */
 #define R_AES_B_AESDCNTH_CCN_CNTR_Pos          (1UL)      /*!< CCN_CNTR (Bit 1)                                      */
 #define R_AES_B_AESDCNTH_CCN_CNTR_Msk          (0x2UL)    /*!< CCN_CNTR (Bitfield-Mask: 0x01)                        */

/* =========================================================================================================================== */
/* ================                                          R_AGTX0                                          ================ */
/* =========================================================================================================================== */

/* =========================================================================================================================== */
/* ================                                          R_IRTC                                           ================ */
/* =========================================================================================================================== */

